{"relativePath":"/posts/2002/08/23/hmm","comments":"","pubDate":"2002-08-23T10:20:00-04:00","title":"hmm","subtitle":"","intro":"","categories":["quote"],"body":"&lt;!-- id=72--&gt;&lt;!-- isMature=0 --&gt;The National Transportation Safety Board recently divulged that they had for the past five years covertly funded a project with US auto makers whereby the auto makers installed black boxes in four wheel drive pickup trucks in an effort to determine, in fatal accidents, the circumstances during the last 15 seconds before the crash. They were surprised to find in 42 of the 50 states that the last words of drivers in 61.2 percent of fatal crashes were, &quot;Oh, Shit!&quot; Only the states of Kentucky, West Virginia, Georgia, Mississippi, Louisiana, Alabama, Texas, and Tennessee were different, where over 89.3 percent of the final words were: &quot;Hold my beer and watch this.&quot;","enclosures":[],"source":{"url":"","title":""},"changefreq":"never","priority":"0.1","bodyArticleHtml":"<hgroup><h3><time datetime=\"2002-08-23T14:20:00.000Z\" pubdate=\"pubdate\">2002-08-23</time></h3><h1><a href=\"http://travis.servebeer.com/posts/2002/08/23/hmm\">hmm</a></h1><h2></h2></hgroup><!-- id=72--><!-- isMature=0 -->The National Transportation Safety Board recently divulged that they had for the past five years covertly funded a project with US auto makers whereby the auto makers installed black boxes in four wheel drive pickup trucks in an effort to determine, in fatal accidents, the circumstances during the last 15 seconds before the crash. They were surprised to find in 42 of the 50 states that the last words of drivers in 61.2 percent of fatal crashes were, "Oh,Shit!" Only the states of Kentucky, West Virginia, Georgia, Mississippi, Louisiana, Alabama, Texas, and Tennessee were different, where over 89.3 percent of the final words were: "Holdmybeerandwatchthis."","bodyNavItems":[{"pageRel":"prev","href":"/posts/2002/09/04/techno-puppet","text":"techno puppet"},{"pageRel":"prev","href":"/posts/2002/08/31/me","text":"me"},{"pageRel":"self","href":"/posts/2002/08/23/hmm","text":"hmm"},{"pageRel":"next","href":"/posts/2002/08/20/new-apt-pics","text":"new apt. pics"},{"href":"/posts/2002/08/15/addict","text":"addict"}]}