{"relativePath":"/posts/2004/04/07/arby-s-excitement","comments":"","pubDate":"2004-04-07T10:43:00-04:00","title":"Arby&#x27;s excitement","subtitle":"","intro":"","categories":["KS","local"],"body":"I randomly chose Arby&#x27;s (on Monroe Ave) for lunch today.  Shortly after I arrived there I realized I had made the right decision.  I could hear some loud voices from behind the counter then it escalated into MF this and MF that.  A white trash punk with a &#x27;black&#x27;cent and an undershirt came out from the back and started slamming shit around.  He started yelling at his manager at the top of his lungs, F this, F you, calling her a bitch many times in the process.  The manager came out from the back and escorted him out of the building.  I wondered if he was fired or if he quit, I&#x27;m guessing a little bit of both.  I got a sourdough beef &#x27;n&#x27; cheddar combo to go.","enclosures":[],"source":{"url":"","title":""},"changefreq":"never","priority":"0.1","bodyArticleHtml":"<hgroup><h3><time datetime=\"2004-04-07T14:43:00.000Z\" pubdate=\"pubdate\">2004-04-07</time></h3><h1><a href=\"http://dieseltravis.github.io/posts/2004/04/07/arby-s-excitement\">Arby&#x27;s excitement</a></h1><h2></h2></hgroup>I randomly chose Arby's (on Monroe Ave) for lunch today.  Shortly after I arrived there I realized I had made the right decision.  I could hear some loud voices from behind the counter then it escalated into MF this and MF that.  A white trash punk with a 'black'cent and an undershirt came out from the back and started slamming shit around.  He started yelling at his manager at the top of his lungs, F this, F you, calling her a bitch many times in the process.  The manager came out from the back and escorted him out of the building.  I wondered if he was fired or if he quit, I'm guessing a little bit of both.  I got a sourdough beef 'n' cheddar combo to go.","bodyNavItems":[{"href":"/posts/2004/04/07/s-m-r-t","text":"S M R T"},{"pageRel":"prev","href":"/posts/2004/04/07/i-have-laid-a-claim-for-traviblog","text":"I have laid a claim for TraviBlog"},{"pageRel":"self","href":"/posts/2004/04/07/arby-s-excitement","text":"Arby&#x27;s excitement"},{"pageRel":"next","href":"/posts/2004/04/07/absoludicrous","text":"Absoludicrous!"},{"href":"/posts/2004/04/06/homo-sapien-1-0","text":"Homo Sapien 1.0"}]}