{"relativePath":"/posts/2007/02/07/new-mac-again","comments":"[object Object]","pubDate":"2007-02-07T05:47:00-05:00","title":"New Mac Again","subtitle":"","intro":"","categories":["tech"],"body":"&lt;p&gt;So my wife convinced herself that she &quot;needed&quot; a new Mac last night. She went out the the East View Mall&#x27;s Mac store and purchased a new MacBook. She was excited to be able to work wirelessly in front of our wood stove on cold nights. Since the word on the street is that Mac&#x27;s wireless is so easy to setup I figured that there wouldn&#x27;t be any issues connecting to our DLink 802.11b/g router. The Mac scanned for and found our wireless network just fine and prompted for the password. We entered the password and... ERROR.&lt;/p&gt;&lt;p&gt;I tried to see if there were some way to enter in any more settings so that I could copy them from my &lt;a href=&quot;http://travis.servebeer.com/blog.net/archive/2006/10/26/Bizarro_World_DS.aspx&quot;&gt;DS&lt;/a&gt;, but couldn&#x27;t find any. I double checked that the router was still working with my DS and it worked fine. I logged into the router to make sure there wasn&#x27;t some Mac/AirPort compatibility checkbox I had missed to no avail. None of our neighbors have their wireless open so that wasn&#x27;t an option either. Finally after hitting a button that said &quot;rescan&quot; there was a prompt to select the model of router. I&#x27;m sure glad that they kept that option hidden so that we could spend half an hour debugging everything else. After selecting DLink, the Mac connected to the internet just fine, although there was no way for our eMac to see it on the network, unless it&#x27;s plugged in via ethernet. Really perplexing since it is the same router controlling both. Ah well.&lt;/p&gt;&lt;p&gt;Then for the icing on the cake. We got a free HP multifunction printer/scanner/copier (after $100 rebate). My wife plugged it into her trusty 4 year old home-made XP Home box. This PC has never crashed, never had a virus/spyware/adware/rootkits, and it&#x27;s only problem was when I accidentally installed the wrong sound driver and the sound didn&#x27;t work until I rolled back to the previous driver. She canceled all the windows new hardware found prompts and just ran the printer&#x27;s CD. It got about halfway through then stalled - no mouse, no keyboard, but no bluescreen. Just a complete freeze. To which she said, &quot;this is why I hate PCs.&quot; Yes, one crash in 4 years is apparently too much. I can&#x27;t tell you how many times there has been a problem with the eMac where the solution has been: just reboot. I tried rebooting and the driver software uninstalled itself, told us to unplug the printer and reboot. We did and can no longer boot up into Windows. There are no error messages, and the MSI debugging LEDs are all green.  I&#x27;m currently running a &lt;a href=&quot;http://www.memtest.org/&quot;&gt;memtest&lt;/a&gt; on it to make sure it isn&#x27;t some bad RAM, but I&#x27;m guessing that there&#x27;s a hard disk error. It just figures that she&#x27;d have hardware issues with her PC the day she got a new Mac.&lt;/p&gt;","enclosures":[],"source":{"url":"","title":""},"changefreq":"never","priority":"0.1","bodyArticleHtml":"<hgroup><h3><time datetime=\"2007-02-07T10:47:00.000Z\" pubdate=\"pubdate\">2007-02-07</time></h3><h1><a href=\"http://dieseltravis.github.io/posts/2007/02/07/new-mac-again\">New Mac Again</a></h1><h2></h2></hgroup><p>So my wife convinced herself that she "needed" a new Mac last night. She went out the the East View Mall's Mac store and purchased a new MacBook. She was excited to be able to work wirelessly in front of our wood stove on cold nights. Since the word on the street is that Mac's wireless is so easy to setup I figured that there wouldn't be any issues connecting to our DLink 802.11b/g router. The Mac scanned for and found our wireless network just fine and prompted for the password. We entered the password and... ERROR.</p><p>I tried to see if there were some way to enter in any more settings so that I could copy them from my <a href="http:<p>Thenfortheicingonthecake.WegotafreeHPmultifunctionprinter/scanner/copier(after$100rebate).Mywifepluggeditintohertrusty4yearoldhome-madeXPHomebox.ThisPChasnevercrashed,neverhadavirus/spyware/adware/rootkits,andit'sonlyproblemwaswhenIaccidentallyinstalledthewrongsounddriverandthesounddidn'tworkuntilIrolledbacktothepreviousdriver.Shecanceledallthewindowsnewhardwarefoundpromptsandjustrantheprinter'sCD.Itgotabouthalfwaythroughthenstalled-nomouse,nokeyboard,butnobluescreen.Justacompletefreeze.Towhichshesaid,"this is why I hate PCs."Yes,onecrashin4yearsisapparentlytoomuch.Ican'ttellyouhowmanytimestherehasbeenaproblemwiththeeMacwherethesolutionhasbeen:justreboot.Itriedrebootingandthedriversoftwareuninstalleditself,toldustounplugtheprinterandreboot.WedidandcannolongerbootupintoWindows.Therearenoerrormessages,andtheMSIdebuggingLEDsareallgreen.I'mcurrentlyrunninga<ahref="http://www.memtest.org/">memtest</a>onittomakesureitisn'tsomebadRAM,butI'mguessingthatthere'saharddiskerror.Itjustfiguresthatshe'dhavehardwareissueswithherPCthedayshegotanewMac.</p>",	"bodyNavItems": [								{									"pageRel": "prev",								"href": "/posts/2007/03/03/a-disturbing-wikiality",				"text": "ADisturbingWikiality"			}					, 			{									"pageRel": "prev",								"href": "/posts/2007/02/07/pc-problems-mac-problems-no-problems",				"text": "PCProblems,MacProblems,NoProblems"			}					, 			{									"pageRel": "self",								"href": "/posts/2007/02/07/new-mac-again",				"text": "NewMacAgain"			}					, 			{									"pageRel": "next",								"href": "/posts/2007/02/05/help-find-jim-gray",				"text": "HelpFindJimGray"			}					, 			{								"href": "/posts/2007/01/29/fun-with-a-foretrex",				"text": "FunWithAForetrex"			}			]}