{"relativePath":"/posts/2004/04/02/greed-vs-long-term-stability-vs-laziness","comments":"","pubDate":"2004-04-02T06:40:00-05:00","title":"greed vs. long term stability vs. laziness","subtitle":"","intro":"","categories":[],"body":"Before commissions, my current stock portfolio ranges from -0.12% to +384.28% (as of today&#x27;s green market).  I&#x27;ve been lucky this time around, the last time I invested my portfolio ranged from -99.5% to -75%.  3 of the stocks that I have right now would have a substantial profit if I sold them today, even after the commissions.  Should I go by the &quot;sell at +20% and -10%&quot; rule, or should I continue holding on until the economy gets back into full swing?  If I sold these 3 stocks today after commissions I&#x27;d have about $900.  Nothing to retire over, but for me that&#x27;s a good sized chunk of change.  I&#x27;ll most likely hold them for now, but I wonder what it would take for me to actually sell them?  Will it take a huge loss to inspire me to sell, or will I hold until they recover (yeah right)?  Will it take a huge growth, or will I hold out for even more growth?  In recent times past it has greatly benefitted me to continue holding them.  My portfolio is on it&#x27;s third year in age.  The entire first year it was all red, the second year it was mixed, and now it&#x27;s mostly green.  Will it get greener?  I&#x27;m guessing I&#x27;ll be inspired to sell when I just need the money - which will probably be soon anyways since I&#x27;ll be buying a house.[Update] The lower end of the range is 0.03% BUT the upper end is now only 228%, damn market.","enclosures":[],"source":{"url":"","title":""},"changefreq":"never","priority":"0.1","bodyArticleHtml":"<hgroup><h3><time datetime=\"2004-04-02T11:40:00.000Z\" pubdate=\"pubdate\">2004-04-02</time></h3><h1><a href=\"http://dieseltravis.github.io/posts/2004/04/02/greed-vs-long-term-stability-vs-laziness\">greed vs. long term stability vs. laziness</a></h1><h2></h2></hgroup>Before commissions, my current stock portfolio ranges from -0.12% to +384.28% (as of today's green market).  I've been lucky this time around, the last time I invested my portfolio ranged from -99.5% to -75%.  3 of the stocks that I have right now would have a substantial profit if I sold them today, even after the commissions.  Should I go by the "sellat+20%and-10%" rule, or should I continue holding on until the economy gets back into full swing?  If I sold these 3 stocks today after commissions I'd have about $900.  Nothing to retire over, but for me that's a good sized chunk of change.  I'll most likely hold them for now, but I wonder what it would take for me to actually sell them?  Will it take a huge loss to inspire me to sell, or will I hold until they recover (yeah right)?  Will it take a huge growth, or will I hold out for even more growth?  In recent times past it has greatly benefitted me to continue holding them.  My portfolio is on it's third year in age.  The entire first year it was all red, the second year it was mixed, and now it's mostly green.  Will it get greener?  I'm guessing I'll be inspired to sell when I just need the money - which will probably be soon anyways since I'll be buying a house.[Update] The lower end of the range is 0.03% BUT the upper end is now only 228%, damn market.","bodyNavItems":[{"pageRel":"prev","href":"/posts/2004/04/06/npr-s-car-talk-lets-me-down","text":"NPR&#x27;s Car Talk lets me down"},{"pageRel":"prev","href":"/posts/2004/04/05/fake-nigerian-419-banks","text":"Fake Nigerian (419) Banks"},{"pageRel":"self","href":"/posts/2004/04/02/greed-vs-long-term-stability-vs-laziness","text":"greed vs. long term stability vs. laziness"},{"pageRel":"next","href":"/posts/2004/04/01/peeps","text":"peeps"},{"href":"/posts/2004/04/01/time-to-move-to-canada","text":"Time to move to Canada..."}]}