{"relativePath":"/posts/2004/12/02/cops-park-ave","comments":"[object Object]","pubDate":"2004-12-02T18:29:00-05:00","title":"COPS: Park Ave","subtitle":"","intro":"","categories":["local"],"body":"&lt;p&gt;Sherry and I made our rounds to all the shops tonight because it was the Holiday Open House on Park Ave. Most of the shops had treats and hot drinks, it was nice but crowded.  A photographer from The Insider took our picture in the pet shop and told us to check the next issue. We ended up eating at Jine&#x27;s for dinner and we had a nice window seat on the corner.  As we were sitting down a couple cops were talking to a guy who&#x27;s car hit a curb and had a flat tire.  I saw a bottle on the top of the guys car as they were handcuffing him and putting him into the cop car, so I&#x27;m assuming that it was a DWI. Then the moron kicks out the back door window of the cop car. The one cop wrestled him to the ground right outside the car on top of all the broken glass.  The guy was still resisting like an idiot, and another cop had to help.  They were struggling for a few minutes when the entire police department showed up along with 2 firetrucks and 2 ambulances. They pepper-sprayed him at least once and put a bag over his head.  It drew a huge crowd that blocked the view, so I probably missed a bunch of cool stuff because it took at least half an hour for them to get the idiot into an ambulance. My neck is sore from watching the whole thing while I was eating. It was funny to hear the stories people were telling each other about what happened.  By the end of the night, the dude was on all kinds of drugs, he smashed the cop&#x27;s window with his head (ha!), the car was stolen, he smashed in other car windows, and a bunch of other things. I didn&#x27;t see evidence of any of that stuff but maybe it happened to occur when people were blocking my view.&lt;/p&gt;&lt;p&gt;I had the Gyro Platter that came with spanakopita, dolmates, and a salad, it was great.&lt;/p&gt;","enclosures":[],"source":{"url":"","title":""},"changefreq":"never","priority":"0.1","bodyArticleHtml":"<hgroup><h3><time datetime=\"2004-12-02T23:29:00.000Z\" pubdate=\"pubdate\">2004-12-02</time></h3><h1><a href=\"http://travis.servebeer.com/posts/2004/12/02/cops-park-ave\">COPS: Park Ave</a></h1><h2></h2></hgroup><p>Sherry and I made our rounds to all the shops tonight because it was the Holiday Open House on Park Ave. Most of the shops had treats and hot drinks, it was nice but crowded.  A photographer from The Insider took our picture in the pet shop and told us to check the next issue. We ended up eating at Jine's for dinner and we had a nice window seat on the corner.  As we were sitting down a couple cops were talking to a guy who's car hit a curb and had a flat tire.  I saw a bottle on the top of the guys car as they were handcuffing him and putting him into the cop car, so I'm assuming that it was a DWI. Then the moron kicks out the back door window of the cop car. The one cop wrestled him to the ground right outside the car on top of all the broken glass.  The guy was still resisting like an idiot, and another cop had to help.  They were struggling for a few minutes when the entire police department showed up along with 2 firetrucks and 2 ambulances. They pepper-sprayed him at least once and put a bag over his head.  It drew a huge crowd that blocked the view, so I probably missed a bunch of cool stuff because it took at least half an hour for them to get the idiot into an ambulance. My neck is sore from watching the whole thing while I was eating. It was funny to hear the stories people were telling each other about what happened.  By the end of the night, the dude was on all kinds of drugs, he smashed the cop's window with his head (ha!), the car was stolen, he smashed in other car windows, and a bunch of other things. I didn't see evidence of any of that stuff but maybe it happened to occur when people were blocking my view.</p><p>I had the Gyro Platter that came with spanakopita, dolmates, and a salad, it was great.</p>","bodyNavItems":[{"pageRel":"prev","href":"/posts/2004/12/07/the-rise-of-the-monkey-clone-army","text":"The Rise of the Monkey-Clone Army"},{"pageRel":"prev","href":"/posts/2004/12/05/boredom","text":"boredom"},{"pageRel":"self","href":"/posts/2004/12/02/cops-park-ave","text":"COPS: Park Ave"},{"pageRel":"next","href":"/posts/2004/11/30/npr-paul-reubens-interview-aka-pee-wee-herman-","text":"NPR Paul Reubens interview (AKA Pee Wee Herman)"},{"href":"/posts/2004/11/30/gouranga-","text":"Gouranga?"}]}