{"relativePath":"/posts/2004/10/07/hello-worldetc-again","comments":"","pubDate":"2004-10-07T21:43:00-04:00","title":"Hello World... Again","subtitle":"","intro":"","categories":["local"],"body":"&lt;p&gt;Well, no thanks to Frontier or Time Warner, I&#x27;m back online again. Apparently DSL isn&#x27;t available in my area yet. It only took a week for Frontier to tell me that. They still haven&#x27;t fixed a loud-ass buzzing noise in my phone line. Time Warner took their sweet ass time hooking up my cable and RoadRunner. I think my cable modem is older than me. Plus my cable box is an older Scientific Atlanta Explorer 2000. So help me god if that thing crashes even once... eh I&#x27;m sure it will. Tomorrow I&#x27;ll have to find all those cool links that everyone already saw and post them anyway.&lt;/p&gt;&lt;p&gt;[UPDATE]: My phone is almost working again.  I lost my dialtone on last Friday because Frontier was &quot;fixing&quot; it.  Just a few minutes ago a repairman let me know that I&#x27;d have a dialtone again and that I could make local calls.  He said he&#x27;d call me when I could receive incoming calls again.&lt;/p&gt;","enclosures":[],"source":{"url":"","title":""},"changefreq":"never","priority":"0.1","bodyArticleHtml":"<hgroup><h3><time datetime=\"2004-10-08T01:43:00.000Z\" pubdate=\"pubdate\">2004-10-07</time></h3><h1><a href=\"http://travis.servebeer.com/posts/2004/10/07/hello-worldetc-again\">Hello World... Again</a></h1><h2></h2></hgroup><p>Well, no thanks to Frontier or Time Warner, I'm back online again. Apparently DSL isn't available in my area yet. It only took a week for Frontier to tell me that. They still haven't fixed a loud-ass buzzing noise in my phone line. Time Warner took their sweet ass time hooking up my cable and RoadRunner. I think my cable modem is older than me. Plus my cable box is an older Scientific Atlanta Explorer 2000. So help me god if that thing crashes even once... eh I'm sure it will. Tomorrow I'll have to find all those cool links that everyone already saw and post them anyway.</p><p>[UPDATE]: My phone is almost working again.  I lost my dialtone on last Friday because Frontier was "fixing" it.  Just a few minutes ago a repairman let me know that I'd have a dialtone again and that I could make local calls.  He said he'd call me when I could receive incoming calls again.</p>","bodyNavItems":[{"pageRel":"prev","href":"/posts/2004/10/11/china-boy-holly","text":"China Boy Holly"},{"pageRel":"prev","href":"/posts/2004/10/11/ie-vs-fx","text":"IE vs. Fx"},{"pageRel":"self","href":"/posts/2004/10/07/hello-worldetc-again","text":"Hello World... Again"},{"pageRel":"next","href":"/posts/2004/09/24/moving","text":"Moving"},{"href":"/posts/2004/09/21/atari-announces-first-64-bit-game","text":"Atari announces first 64-bit game"}]}